bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
/*
plug pinout at end with holes facing you: https://learn.adafruit.com/system/assets/assets/000/023/826/medium800/led_matrix_plug2.png?1426392350
____________________________
|GND	STB	D	B	GND	G1	GND	GO|
|/OE	CLK	C	A	B1	R1	B0	R0|
¯¯¯¯¯¯¯¯¯¯¯¯¯|_|¯¯¯¯¯¯¯¯¯¯¯¯

place board with silkscreen upright facing you, then flip board horizontally (left side to right side)
pixels shift in from right to left

top 16 rows (clock in 32 pixels)
R0	PC3
G0	PC8
B0	PC11

bottom 16 rows (clock in 32 pixels)
R1	PC12
G1	PC13
B1	PC14

4 bit selector selects the 2 active rows for the top and bottom (eg 0 selects rows 0 and 16). These are asynchronous and alters the row without a clock or latch
A		PE2
B		PE3
C		PE4
D		PE5

CLK	PD4		clock the data into the latches for both top and bottom sections
STB	PD5	latches the data into the leds for both top and bottom sections

output enable turns the currently latched LEDs on or off and is active low
/OE PE6 for both top and bottom sections

unlabled pins on this port connect to ground

free pins:
PA0 (if the user button is not used), PA5, PA9, PA10
PB4, PB7
PC15
PD2, PD7
PF6
PG2, PG3, PG13 (green led), PG14 (red led)
*/

#include "main.h"
#include "HelperFunctions.h"
#include "registers.h"
#include "STM32F4-lib.h"
#include "Nx32_RGB_LED.h"
#include <math.h>
#include <stdarg.h>

extern unsigned short ascii_7x11[95][14];
extern unsigned int asciivbw[559];
extern uint16_t ascii_16x24[];
extern uint16_t ascii_12x12[];
extern uint16_t ascii_8x12[];
extern uint16_t ascii_8x8[];
extern unsigned int hebrewfontvbw[205];

const unsigned int sevsegasciivbw[30]=
{
	31,17,31,	//0
	0,0,31,	  	//right aligned 1
	//0,31,0,	//centre aligned 1
	29,21,23, 	//2
	21,21,31, 	//3
	7,4,31,	  	//4
	23,21,29,	//5
	31,21,29, 	//6
	1,1,31,	  	//7
	31,21,31, 	//8
	23,21,31	//9
};

void InitRGBLEDMatrix(void)
{
	ConfigPinOnPort(R0Port, R0Pin, 'l');
	ConfigPinOnPort(G0Port, G0Pin, 'l');
	ConfigPinOnPort(B0Port, B0Pin, 'l');
	ConfigPinOnPort(R1Port, R1Pin, 'l');
	ConfigPinOnPort(G1Port, G1Pin, 'l');
	ConfigPinOnPort(B1Port, B1Pin, 'l');
	ConfigPinOnPort(RowSelectAPort, RowSelectAPin, 'l');
	ConfigPinOnPort(RowSelectBPort, RowSelectBPin, 'l');
	ConfigPinOnPort(RowSelectCPort, RowSelectCPin, 'l');
	ConfigPinOnPort(RowSelectDPort, RowSelectDPin, 'l');
	ConfigPinOnPort(CLKPort, CLKPin, 'l');
	ConfigPinOnPort(STBPort, STBPin, 'l');
	ConfigPinOnPort(OEPort, OEPin, 'l');

	StartTimer14(4500-1);	//10Khz
}

void RGBLEDMatrixPixelTest(unsigned int colour, unsigned int delayMS)	//top to bottom, right to left
{
	unsigned int x;
	unsigned int y;

	delayMS*=1000;
	
	//top half of screen
	ClearPin(R1Port, R1Pin);
	ClearPin(G1Port, G1Pin);
	ClearPin(B1Port, B1Pin);

	for(y=0;y<16;y++)
	{		
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(x==0)	//put the data into the start of the shift register
			{
				if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
				if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
				if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
			}else	//shift in 0 for the rest
			{
				ClearPin(B0Port, B0Pin);
				ClearPin(G0Port, G0Pin);
				ClearPin(R0Port, R0Pin);
			}
			__asm{ NOP }
			
			SetPin(CLKPort, CLKPin);	//clock high
			waitsys(1);
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
			
			//display every shift
			SetPin(STBPort, STBPin);	//latch high
			waitsys(1);
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
			//select the row
			SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
			__asm{ NOP }
			if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
			if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
			if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
			if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
			__asm{ NOP }
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
			
			waitsys(delayMS);
		}
	}
	
	//bottom half of screen
	ClearPin(R0Port, R0Pin);
	ClearPin(G0Port, G0Pin);
	ClearPin(B0Port, B0Pin);
	
	for(y=0;y<16;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(x==0)	//put the data into the start of the shift register
			{
				if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
				if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
				if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
			}else	//shift in 0 for the rest
			{
				ClearPin(B1Port, B1Pin);
				ClearPin(G1Port, G1Pin);
				ClearPin(R1Port, R1Pin);
			}
			__asm{ NOP }
			__asm{ NOP }
				
			SetPin(CLKPort, CLKPin);	//clock high
			__asm{ NOP }
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
			
			//display every shift
			SetPin(STBPort, STBPin);	//latch high
			__asm{ NOP }
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
			//select the row
			SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
			__asm{ NOP }
			if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
			if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
			if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
			if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
			__asm{ NOP }
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
			
			waitsys(delayMS);
		}
	}
}

void RGBLEDMatrixLightUpPixel(unsigned int x, unsigned int y, unsigned int colour)
{
	unsigned int i;
	
	x=(LedMatrixWidth-1)-x;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
	if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
	if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
	if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
	__asm{ NOP }
	
