bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
	if(y<16)
	{
		if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
		if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
		if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
	}else
	{
		if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
		if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
		if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
	}
	
	SetPin(CLKPort, CLKPin);	//clock high
	waitsys(1);
	ClearPin(CLKPort, CLKPin);	//clock low
	__asm{ NOP }
	
	if(y<16)
	{
		ClearPin(B0Port, B0Pin);
		ClearPin(G0Port, G0Pin);
		ClearPin(R0Port, R0Pin);
	}else
	{
		ClearPin(B1Port, B1Pin);
		ClearPin(G1Port, G1Pin);
		ClearPin(R1Port, R1Pin);
	}
	
	for(i=0;i<LedMatrixWidth;i++)
	{
		if(i==x)
		{
			SetPin(STBPort, STBPin);	//latch high
			waitsys(1);
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
		}
		
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
}

void RGBLEDMatrixLightUpLine(unsigned int y, unsigned int colour)
{
	unsigned int i;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
	if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
	if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
	if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
	__asm{ NOP }
	
	if(y<16)
	{
		ClearPin(B1Port, B1Pin);
		ClearPin(G1Port, G1Pin);
		ClearPin(R1Port, R1Pin);
		if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
		if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
		if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }

	}else
	{
		ClearPin(B0Port, B0Pin);
		ClearPin(G0Port, G0Pin);
		ClearPin(R0Port, R0Pin);
		if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
		if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
		if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }

	}
	__asm{ NOP }
	
	for(i=0;i<LedMatrixWidth;i++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	SetPin(STBPort, STBPin);	//latch high
	__asm{ NOP }
	ClearPin(STBPort, STBPin);	//latch low
	__asm{ NOP }
	
	ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
	__asm{ NOP }
}

void RGBLEDMatrixLightUpAreaSegmented(unsigned int x1, unsigned int y1, unsigned int x2, unsigned int y2, unsigned int colour)
{
	unsigned int x;
	unsigned int y;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	//limit to top or bottom
	if((y1<16) && (y2>15)){ y2=15; }
	
	//clear the shift registers (top and bottom)
	for(x=0;x<LedMatrixWidth;x++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	if(y1<16)
	{
		if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
		if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
		if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
	}else
	{
		if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
		if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
		if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
	}
	
	//shift in data
	for(x=x1;x<=x2;x++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	if(y1<16)
	{
		ClearPin(B0Port, B0Pin);
		ClearPin(G0Port, G0Pin);
		ClearPin(R0Port, R0Pin);
	}else
	{
		ClearPin(B1Port, B1Pin);
		ClearPin(G1Port, G1Pin);
		ClearPin(R1Port, R1Pin);
	}
	
	//offset to xstart
		for(x=0;x<x1;x++)
		{
			SetPin(CLKPort, CLKPin);	//clock high
			waitsys(1);
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
		}
	
	//cycle the line over all y lines
	for(y=y1;y<=y2;y++)
	{
		if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
		if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
		if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
		if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
		__asm{ NOP }
		
		if(y==y1)
		{
			SetPin(STBPort, STBPin);	//latch high
			waitsys(1);
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
		}
		
		waitsys(100);
	}
}

void RGBLEDMatrixLightUpArea(unsigned int x1, unsigned int y1, unsigned int x2, unsigned int y2, unsigned int colour)
{
	unsigned int tmp;
	
	x1=(LedMatrixWidth-1)-x1;
	x2=(LedMatrixWidth-1)-x2;
	
	//may sure p2 coords are below p1 coords
	if(x1>x2){ tmp=x1; x1=x2; x2=tmp; }
	if(y1>y2){ tmp=y1; y1=y2; y2=tmp; }

	if((y1 & 0x10)==(y2 & 0x10))
	{
		RGBLEDMatrixLightUpAreaSegmented(x1, y1, x2, y2, colour);
	}else
	{
		RGBLEDMatrixLightUpAreaSegmented(x1, y1, x2, 15, colour);
		RGBLEDMatrixLightUpAreaSegmented(x1, 16, x2, y2, colour);
	}
}

void RGBLEDMatrixLightScreen(unsigned int colour)
{
	unsigned int i;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	if(colour & 1){ SetPin(B0Port, B0Pin); SetPin(B1Port, B1Pin); }else{ ClearPin(B0Port, B0Pin); ClearPin(B1Port, B1Pin); }
	if(colour & 2){ SetPin(G0Port, G0Pin); SetPin(G1Port, G1Pin); }else{ ClearPin(G0Port, G0Pin); ClearPin(G1Port, G1Pin); }
	if(colour & 4){ SetPin(R0Port, R0Pin); SetPin(R1Port, R1Pin); }else{ ClearPin(R0Port, R0Pin); ClearPin(R1Port, R1Pin); }
	__asm{ NOP }
	
	for(i=0;i<LedMatrixWidth;i++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	SetPin(STBPort, STBPin);	//latch high
	__asm{ NOP }
	ClearPin(STBPort, STBPin);	//latch low
	__asm{ NOP }
	
	for(i=0;i<16;i++)
	{
		if(i & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
		if(i & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
		if(i & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
		if(i & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
		__asm{ NOP }
		
		ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
		__asm{ NOP }
		
		waitsys(10);
	}
}

void RGBLEDMatrixClearScreen(void)
{
	unsigned int i;
	
