bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
		waitsys(100);
	}
}


void RGBLEDMatrixDispBitmap4bit(unsigned int bitmap[][32])	//	//3 4-bit values 00000000 00000000 0000RRRR GGGG BBBB. 2 lines at a time with 4 bit pwm
{
	unsigned int x, y, y2, i;
	for(i=0;i<16;i++)	//display the frame 16 times to generate software PWM
	{
		if (i != 15 ) {
			for(y=0;y<16;y++)
			{
				y2=y+16;
				
				for(x=0;x<LedMatrixWidth;x++)
				{
					if(i < (bitmap[x][y] & 0xF)){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
					if(i < ((bitmap[x][y]>>4) & 0xF)){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
					if(i < ((bitmap[x][y]>>8) & 0xF)){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
					
					if(i < (bitmap[x][y2] & 0xF)){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
					if(i < ((bitmap[x][y2]>>4) & 0xF)){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
					if(i < ((bitmap[x][y2]>>8) & 0xF)){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
						
					SetPin(CLKPort, CLKPin);	//clock high
					__asm{ NOP }
					ClearPin(CLKPort, CLKPin);	//clock low
				}
				
				//select the row
				SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
				__asm{ NOP }
				if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
				if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
				if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
				if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
				__asm{ NOP }
				SetPin(STBPort, STBPin);	//latch high
				__asm{ NOP }
				ClearPin(STBPort, STBPin);	//latch low
				__asm{ NOP }
				ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			}
		} else SetPin(OEPort,OEPin);
	}
}


// 00000000 RRRRRRRR GGGGGGGG BBBBBBBB. 64 pixel at a time using 8 bit weighted binary
void RGBLEDMatrixDispBitmap8bit(unsigned int bitmap[][32])
{
    unsigned int x, y, y2, i,b;
	int d1,d2;
    
	for(i=0;i<8;i++)
	{
		  b = 1<<i;
			for(y=0;y<16;y++)
			{
				y2=y+16;
		
				for(x=0;x<LedMatrixWidth;x++)
				{
  				ClearPin(CLKPort, CLKPin);  // clock low
					__asm{ NOP }
	
					d1 = bitmap[x][y];
					if (b & d1)        { SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
					if (b & (d1>>8))   { SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
					if (b & (d1>>16))  { SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
					
   				d2 = bitmap[x][y2];
					if (b & d2)       { SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
					if (b & (d2>>8))  { SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
					if (b & (d2>>16)) { SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
					__asm{ NOP }
					__asm{ NOP }
						
					SetPin(CLKPort, CLKPin);    // clock high
					__asm{ NOP }
				}
				ClearPin(CLKPort, CLKPin);  // clock low
				__asm{ NOP }
				
				// Select the row
				if (y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
				if (y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
				if (y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
				if (y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
				__asm{ NOP }

				SetPin(STBPort, STBPin);   // latch high
				__asm{ NOP }
				ClearPin(STBPort, STBPin); // latch low
				__asm{ NOP }
				
				ClearPin(OEPort,OEPin);	// Enable output
				waitsys(b<<1);
				SetPin(OEPort,OEPin);
				__asm{ NOP }
			}
	}
}


void RGBLEDMatrixDisplayBitmap(unsigned int bitmap[][32], unsigned int mode)
{
	switch(mode)
	{
		case DisplayMode1bit1px:
			RGBLEDMatrixDispBitmap1bit1px(bitmap);
		break;
		case DisplayMode1bit1Line:
			RGBLEDMatrixDispBitmap1bit1Line(bitmap);
		break;
		case DisplayMode1bit2Lines:
			RGBLEDMatrixDispBitmap1bit2Lines(bitmap);
		break;
		case DisplayMode4bit:
			RGBLEDMatrixDispBitmap4bit(bitmap);
		break;
		case DisplayMode8bit:
			RGBLEDMatrixDispBitmap8bit(bitmap);
		break;
	}	
}

void RGBLEDMatrixDisplayBitmapDuration(unsigned int bitmap[][32], unsigned int durationMS, unsigned int mode)
{
	durationMS*=10;
	ResetTimer14();
	while(ReadTimer14()<durationMS)
	{
		RGBLEDMatrixDisplayBitmap(bitmap,mode);
	}	
}

void RGBLEDMatrixBitmapTest(unsigned int mode)	//run this in a loop
{
	unsigned int x,y,c,r,g,b,yy;
	unsigned int bitmap[LedMatrixWidth][32]={0};
	
	if(mode<=DisplayMode1bit2Lines)	//1 bit test pattern (checker board)
	{
		for(y=0;y<31;y+=4)
		{
			for(x=0;x<LedMatrixWidth-1;x+=4)
			{
				c=((x>>2)+(y>>2)) & 7;
				for(yy=0;yy<4;yy++)
				{
					bitmap[x][y+yy]=c;
					bitmap[x+1][y+yy]=c;
					bitmap[x+2][y+yy]=c;
					bitmap[x+3][y+yy]=c;
				}
			}
		}
	}else
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(mode==DisplayMode4bit)	//4 bit gradient bars
			{
				r=(x*15)/LedMatrixWidth;
				g=r<<4;
				b=r<<8;
			}else	//8 bit gradient bars
			{
				r=(x*255)/LedMatrixWidth;
				g=r<<8;
				b=r<<16;
			}
			
			//black
			bitmap[x][0]=0;
			bitmap[x][1]=0;
			bitmap[x][2]=0;
			bitmap[x][3]=0;
			
			//r
			bitmap[x][4]=r;
			bitmap[x][5]=r;
			bitmap[x][6]=r;
			bitmap[x][7]=r;
			
			//rg
			bitmap[x][8]=r | g;
			bitmap[x][9]=r | g;
			bitmap[x][10]=r | g;
			bitmap[x][11]=r | g;
			
			//g
			bitmap[x][12]=g;
			bitmap[x][13]=g;
			bitmap[x][14]=g;
			bitmap[x][15]=g;
			
			//gb
			bitmap[x][16]=g | b;
			bitmap[x][17]=g | b;
			bitmap[x][18]=g | b;
			bitmap[x][19]=g | b;
			
			//b
			bitmap[x][20]=b;
			bitmap[x][21]=b;
			bitmap[x][22]=b;
			bitmap[x][23]=b;
			
			//br
			bitmap[x][24]=b | r;
			bitmap[x][25]=b | r;
			bitmap[x][26]=b | r;
			bitmap[x][27]=b | r;
			
			bitmap[x][28]=r | g | b;
			bitmap[x][29]=r | g | b;
			bitmap[x][30]=r | g | b;
			bitmap[x][31]=r | g | b;
		}
	}
	
	RGBLEDMatrixDisplayBitmap(bitmap,mode);
}

void RGBLEDMatrixClear(unsigned int bitmap[][32], unsigned int colour)
{
	unsigned int x, y;

