bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			bitmap[x][y]=colour;
		}
	}
}

void RGBLEDMatrixCopy(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32])
{
	unsigned int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			destbitmap[x][y]=sourcebitmap[x][y];
		}
	}
}

void RGBLEDMatrixSetPixel(unsigned int bitmap[][32], int x, int y, unsigned int colour)	//1 or 4 bit format
{
	if((x>=0) && (x<=(LedMatrixWidth-1)) && (y>=0) && (y<=(LedMatrixHeight-1)))
	{
		bitmap[x][y]=colour;
	}
}

void RGBLEDMatrixMix(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32])
{
	unsigned int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			destbitmap[x][y]=sourcebitmap[x][y] | destbitmap[x][y];
		}
	}
}

void RGBLEDMatrixMultiply(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32])
{
	unsigned int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			destbitmap[x][y]=(sourcebitmap[x][y] * destbitmap[x][y])>>5;
		}
	}
}

unsigned int RGBLEDMatrixReadPixel(unsigned int bitmap[][32], int x, int y)
{
	if((x>=0) && (x<=(LedMatrixWidth-1)) && (y>=0) && (y<=31))
	{
		return bitmap[x][y];
	}else
	{
		return 0;
	}
}

void RGBLEDMatrixMixPixel(unsigned int bitmap[][32], int x, int y, unsigned int colour)
{
	RGBLEDMatrixSetPixel(bitmap,x,y,RGBLEDMatrixReadPixel(bitmap,x,y) | colour);
}

void RGBLEDMatrixReplaceColourWithColour(unsigned int bitmap[][32], unsigned int ColourToReplace, unsigned int ReplacementColour)
{
	int x, y;

	for(y=0;y<8;y++)
	{
		for(x=0;x<8;x++)
		{
			if(RGBLEDMatrixReadPixel(bitmap,x,y)==ReplacementColour){ RGBLEDMatrixSetPixel(bitmap,x,y,ColourToReplace); }
		}
	}
}

void RGBLEDMatrixReplaceColourWithBmp(unsigned int bitmap[][32], unsigned int ColourToReplace, unsigned int backgroundbitmap[][32])
{
	int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(bitmap[x][y]==ColourToReplace){ bitmap[x][y]=backgroundbitmap[x][y]; }
		}
	}
}

void RGBLEDMatrixReplaceColourWithBmpIntoBmp(unsigned int bitmap[][32], unsigned int ColourToReplace, unsigned int backgroundbitmap[][32], unsigned int destbitmap[][32])
{
	int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(bitmap[x][y]==ColourToReplace){ destbitmap[x][y]=backgroundbitmap[x][y]; }else{ destbitmap[x][y]=bitmap[x][y]; }
		}
	}
}

void RGBLEDMatrixFadeDown(unsigned int bitmap[][32], unsigned int delayMS)
{	
	int x, y, r, g, b;
	unsigned int changed;

	do
	{
		changed=0;
		for(y=0;y<32;y++)
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				b=bitmap[x][y] & 0xF;
				g=((bitmap[x][y])>>4) & 0xF;
				r=((bitmap[x][y])>>8) & 0xF;
				if(r!=0){ r-=1; changed=1; }
				if(g!=0){ g-=1; changed=1;  }
				if(b!=0){ b-=1; changed=1;  }
				
				bitmap[x][y]=(r<<8) | (g<<4) | b;
			}
		}
		RGBLEDMatrixDisplayBitmapDuration(bitmap, delayMS, DisplayMode8bit);
	}while(changed==1);
}

void RGBLEDMatrixFadeUp(unsigned int bitmap[][32], unsigned int delayMS)
{	
	int x, y, r1, g1, b1, r2, g2, b2;
	unsigned int changed;
	unsigned int bmp[LedMatrixWidth][32]={0};

	do
	{
		changed=0;
		for(y=0;y<32;y++)
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				b1=bitmap[x][y] & 0xF;
				g1=((bitmap[x][y])>>4) & 0xF;
				r1=((bitmap[x][y])>>8) & 0xF;
				
				b2=bmp[x][y] & 0xF;
				g2=((bmp[x][y])>>4) & 0xF;
				r2=((bmp[x][y])>>8) & 0xF;
				
				if(r2!=r1){ r2+=1; changed=1; }
				if(g2!=g1){ g2+=1; changed=1;  }
				if(b2!=b1){ b2+=1; changed=1;  }
				
				bmp[x][y]=(r2<<8) | (g2<<4) | b2;
			}
		}
		RGBLEDMatrixDisplayBitmapDuration(bmp, delayMS, DisplayMode8bit);
	}while(changed==1);
}

void RGBLEDMatrixFadeBetween(unsigned int bitmap1[][32], unsigned int bitmap2[][32])
{	
	int x, y, i, r1, g1, b1, r2, g2, b2;
	unsigned int bmp[LedMatrixWidth][32]={0};

	for(i=0;i<256;i+=2)
	{
		for(y=0;y<32;y++)
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				r1=bitmap1[x][y]>>16;
				g1=(bitmap1[x][y]>>8) & 0xFF;
				b1=bitmap1[x][y] & 0xFF;

				r2=bitmap2[x][y]>>16;
				g2=(bitmap2[x][y]>>8) & 0xFF;
				b2=bitmap2[x][y] & 0xFF;
				
				r1=r1+(((r2-r1)*i)/255);
				g1=g1+(((g2-g1)*i)/255);
				b1=b1+(((b2-b1)*i)/255);
				bmp[x][y]=(r1<<16) | (g1<<8)  | b1;
			}
		}
		RGBLEDMatrixDisplayBitmap(bmp, DisplayMode8bit);
	}
}

void RGBLEDMatrixLine(unsigned int bitmap[][32], int x1, int y1, int x2, int y2,  unsigned int colour)
{
	int x, y, xdelta, ydelta, width, height, i, count;
	
	if(y1==y2)
	{
		if((y1>=0) && (y1<=31))
		{
			if(x1>x2){ x=x2; x2=x1; x1=x; }
			for(x=x1;x<=x2;x++)
			{
				RGBLEDMatrixSetPixel(bitmap,x,y1,colour);
			}
		}
	  return;
	}

	if(x1==x2)
	{
		if((x1>=0) && (x1<=(LedMatrixWidth-1)))
		{
			if(y1>y2){ y=y2; y2=y1; y1=y; }
			for(y=y1;y<=y2;y++)
			{
				RGBLEDMatrixSetPixel(bitmap,x1,y,colour);
			}
		}
	  return;
	}
	
	width = x2 - x1;
	height = y2 - y1;
	
	count = max(iabs(width),iabs(height));

	xdelta = (width << 16) / count;
	ydelta = (height << 16) / count;

	x = x1 << 16;
	y = y1 << 16;

	for (i = 0;i <= count;i++)
	{
		RGBLEDMatrixSetPixel(bitmap,x>>16,y>>16,colour);
		x += xdelta;
		y += ydelta;
	}	
}

void RGBLEDMatrixRectangle(unsigned int bitmap[][32], int x1, int y1, int x2, int y2,  unsigned int colour)
{
	int tmp;
	int x;
	int y;
	
	if(x1>x2){ tmp=x2; x2=x1; x1=tmp; }
	if(y1>y2){ tmp=y2; y2=y1; y1=tmp; }

	for(x=x1;x<=x2;x++)
	{
		RGBLEDMatrixSetPixel(bitmap,x,y1,colour);
		RGBLEDMatrixSetPixel(bitmap,x,y2,colour);
	}
	for(y=y1;y<=y2;y++)
	{
		RGBLEDMatrixSetPixel(bitmap,x1,y,colour);
		RGBLEDMatrixSetPixel(bitmap,x2,y,colour);
	}
}

void RGBLEDMatrixRectangleFilled(unsigned int bitmap[][32], int x1, int y1, int x2, int y2,  unsigned int colour)
{
	int tmp;
	int x;
	int y;
	
	if(x1>x2){ tmp=x2; x2=x1; x1=tmp; }
	if(y1>y2){ tmp=y2; y2=y1; y1=tmp; }

	for(x=x1;x<=x2;x++)
	{
		for(y=y1;y<=y2;y++)
		{
			RGBLEDMatrixSetPixel(bitmap,x,y,colour);
		}
	}
}

void RGBLEDMatrixCircle(unsigned int bitmap[][32], int x0, int y0, int radius, unsigned int colour)
{
	int f = 1 - radius;
	int ddF_x = 1;
	int ddF_y = -2 * radius;
	int x = 0;
	int y = radius;
	
