bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
	RGBLEDMatrixSetPixel(bitmap,x0, y0 + radius,colour);
	RGBLEDMatrixSetPixel(bitmap,x0, y0 - radius,colour);
	RGBLEDMatrixSetPixel(bitmap,x0 + radius, y0,colour);
	RGBLEDMatrixSetPixel(bitmap,x0 - radius, y0,colour);
	
	while(x < y)
	{
		if(f >= 0) 
		{
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;
		    
		RGBLEDMatrixSetPixel(bitmap,x0 + x, y0 + y,colour);	//segment 4
		RGBLEDMatrixSetPixel(bitmap,x0 - x, y0 + y,colour);	//segment 5
		RGBLEDMatrixSetPixel(bitmap,x0 + x, y0 - y,colour);	//segment 1
		RGBLEDMatrixSetPixel(bitmap,x0 - x, y0 - y,colour);	//segment 8
		RGBLEDMatrixSetPixel(bitmap,x0 + y, y0 + x,colour);	//segment 3
		RGBLEDMatrixSetPixel(bitmap,x0 - y, y0 + x,colour);	//segment 6
		RGBLEDMatrixSetPixel(bitmap,x0 + y, y0 - x,colour);	//segment 2
		RGBLEDMatrixSetPixel(bitmap,x0 - y, y0 - x,colour);	//segment 7
	}
}

void RGBLEDMatrixCircleFilled(unsigned int bitmap[][32], int x0, int y0, int radius, unsigned int colour)
{
	int f = 1 - radius;
	int ddF_x = 1;
	int ddF_y = -2 * radius;
	int x = 0;
	int y = radius;
	
	RGBLEDMatrixLine(bitmap, x0 - radius,y0,x0 + radius+1,y0,colour);
	
	while(x < y)
	{
		if(f >= 0) 
		{
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;
		    
		RGBLEDMatrixLine(bitmap, x0 + x, y0 - y,x0 - x, y0 - y,colour);	//segment 1 to 8
		RGBLEDMatrixLine(bitmap, x0 + y, y0 - x,x0 - y, y0 - x,colour);	//segment 2 to 7
		RGBLEDMatrixLine(bitmap, x0 + y, y0 + x,x0 - y, y0 + x,colour);	//segment 3 to 6
		RGBLEDMatrixLine(bitmap, x0 + x, y0 + y,x0 - x, y0 + y,colour);	//segment 4 to 5
	}
}

void RGBLEDMatrixInvertColours(unsigned int bitmap[][32])
{
	int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			bitmap[x][y] ^= 0xFFF;
		}
	}
}

void RGBLEDMatrixShiftLeft(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			RGBLEDMatrixSetPixel(bitmap,x,y,RGBLEDMatrixReadPixel(bitmap,x+shift,y));
		}
	}
}

void RGBLEDMatrixShiftRight(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(y=0;y<32;y++)
	{
		for(x=(LedMatrixWidth-1);x>=0;x--)
		{
			RGBLEDMatrixSetPixel(bitmap,x,y,RGBLEDMatrixReadPixel(bitmap,x-shift,y));
		}
	}
}

void RGBLEDMatrixShiftUp(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(x=0;x<LedMatrixWidth;x++)
	{
		for(y=0;y<32;y++)
		{
			RGBLEDMatrixSetPixel(bitmap,x,y,RGBLEDMatrixReadPixel(bitmap,x,y+shift));
		}
	}
}

void RGBLEDMatrixShiftDown(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(x=0;x<LedMatrixWidth;x++)
	{
		for(y=31;y>=0;y--)
		{
			RGBLEDMatrixSetPixel(bitmap,x,y,RGBLEDMatrixReadPixel(bitmap,x,y-shift));
		}
	}
}

void BmpRotate(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32], double angle, double midx, double midy)
{
  double x;
	double y;
	double xold;
	double yold;
	double xnew;
	double ynew;
	double s,c,yoldS,yoldC;
	
	s=sin((angle * 3.14159) / 180.0);
	c=cos((angle * 3.14159) / 180.0);

	for(y=0;y<32;y++)
	{
	  yold = y - midy;
		yoldS=yold * s;
		yoldC=yold * c;
		for(x=0;x<LedMatrixWidth;x++)
		{
			xold = x - midx;
			xnew = (xold * c) - yoldS;
			ynew = (xold * s) + yoldC;
			RGBLEDMatrixSetPixel(destbitmap,rint(xnew + midx),rint(ynew + midy),RGBLEDMatrixReadPixel(sourcebitmap,x,y));
	  }
	}
}

unsigned int RGBLEDMatrixCharacter(unsigned int bitmap[][32], char character, int x1, int y1, unsigned int colour, unsigned int font)
{
	int x;
	int y;
	int bytenum;

	if(font==LedFontVariableWidth)
	{
		x=0;
		for(bytenum=asciivbw[character-' '];bytenum<(asciivbw[character-' ']+asciivbw[95+(character-' ')]);bytenum++)
		{
			for(y=0;y<8;y++)	//add byte
			{
				if(((asciivbw[bytenum]>>y) & 1)==1){ RGBLEDMatrixSetPixel(bitmap,x+x1,y+y1,colour); }
			}
			x+=1;
		}
	}
	
	if(font==LedFont7x11)
	{
		for(x=0;x<7;x++)
		{
			for(y=5;y<16;y++)
			{
				if((ascii_7x11[character-0x20][x]>>y) & 1)
				{
					RGBLEDMatrixSetPixel(bitmap,x+x1,y+y1-5,colour);
				}
			}
		}
	}
	
	return x1+x+1;
}

unsigned int RGBLEDMatrixGetCharacterLength(char character)
{
	return asciivbw[95+(character-' ')];
}

void RGBLEDMatrixShiftInCharacter(unsigned int bitmap[][32], char character, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int x, y;
	unsigned int bytenum, mS;
	
	mS=1000/fps;

	if(font==LedFontVariableWidth)
	{
		for(bytenum=asciivbw[character-' '];bytenum<(asciivbw[character-' ']+asciivbw[95+(character-' ')]);bytenum++)
		{
			ResetTimer14();
			for(y=0;y<8;y++)	//add byte
			{
				if(((asciivbw[bytenum]>>y) & 1)==1){ RGBLEDMatrixSetPixel(bitmap,xRight,yTop+y,colour); }
			}
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
			RGBLEDMatrixDisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
			RGBLEDMatrixShiftLeft(bitmap,1);	//scroll
		}
	}
	
	if(font==LedFont7x11)
	{
		for(x=0;x<7;x++)
		{
			for(y=5;y<16;y++)
			{
				if((ascii_7x11[character-0x20][x]>>y) & 1)
				{
					RGBLEDMatrixSetPixel(bitmap,xRight,yTop+y-5,colour);
				}
			}
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
			RGBLEDMatrixDisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
			RGBLEDMatrixShiftLeft(bitmap,1);	//scroll
		}
	}

	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
	RGBLEDMatrixDisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
	RGBLEDMatrixShiftLeft(bitmap,1);	//extra 1px space after the character
}

//0 to 26 character start index
//27 to 53 words per character
//54 to 204 words per character
void RGBLEDMatrixShiftInCharacterHebrew(unsigned int bitmap[][32], char character, int xLeft, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int y, mS, i;
	int wordnum;
	
