bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
	mS=1000/fps;

	if(character!=' ')
	{
		for(wordnum=hebrewfontvbw[character-1]+hebrewfontvbw[27+(character-1)]-1;wordnum>=hebrewfontvbw[character-1];wordnum--)
		{
			ResetTimer14();
			for(y=0;y<16;y++)	//add word
			{
				if(((hebrewfontvbw[wordnum]>>y) & 1)==1){ RGBLEDMatrixSetPixel(bitmap,xLeft,yTop+y,colour); }
			}
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
			RGBLEDMatrixDisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
			RGBLEDMatrixShiftRight(bitmap,1);	//scroll
		}
	}else
	{
			for(i=0;i<5;i++)
			{
				ResetTimer14();
				if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
				RGBLEDMatrixDisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
				if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
				RGBLEDMatrixShiftRight(bitmap,1);	//scroll
			}
	}

	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
	RGBLEDMatrixDisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
	RGBLEDMatrixShiftRight(bitmap,1);	//extra 1px space after the character
}

void RGBLEDMatrixShiftInCharacterWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], char character, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int x, y;
	unsigned int bytenum, mS;
	unsigned int outputbitmap[32][32];
	
	mS=1000/fps;

	if(font==LedFontVariableWidth)
	{
		for(bytenum=asciivbw[character-' '];bytenum<(asciivbw[character-' ']+asciivbw[95+(character-' ')]);bytenum++)
		{
			ResetTimer14();
			for(y=0;y<8;y++)	//add byte
			{
				if(((asciivbw[bytenum]>>y) & 1)==1){ RGBLEDMatrixSetPixel(bitmap,xRight,yTop+y,colour); }
			}
			
			RGBLEDMatrixReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
			RGBLEDMatrixDisplayBitmapDuration(outputbitmap, mS, DisplayMode);		//display frame
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
			RGBLEDMatrixShiftLeft(bitmap,1);	//scroll
		}
	}
	
	if(font==LedFont7x11)
	{
		for(x=0;x<7;x++)
		{
			for(y=5;y<16;y++)
			{
				if((ascii_7x11[character-0x20][x]>>y) & 1)
				{
					RGBLEDMatrixSetPixel(bitmap,xRight,yTop+y-5,colour);
				}
			}
			RGBLEDMatrixReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
			RGBLEDMatrixDisplayBitmapDuration(outputbitmap, mS, DisplayMode);		//display frame
			if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
			RGBLEDMatrixShiftLeft(bitmap,1);	//scroll
		}
	}

	RGBLEDMatrixReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
	RGBLEDMatrixDisplayBitmapDuration(outputbitmap, mS, DisplayMode);		//display frame
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
	RGBLEDMatrixShiftLeft(bitmap,1);	//extra 1px space after the character
}

void RGBLEDMatrixScrollText(unsigned int bitmap[][32], char characters[200], int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int i=0;

	while(characters[i]!=0)
	{
		RGBLEDMatrixShiftInCharacter(bitmap, characters[i], xRight, yTop, fps, colour, font, DisplayMode, flipAxis);
		i++;
	}
}

void RGBLEDMatrixScrollTextHebrew(unsigned int bitmap[][32], char characters[200], int xLeft, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int i=0;

	while(characters[i]!=0)
	{
		RGBLEDMatrixShiftInCharacterHebrew(bitmap, characters[i], xLeft, yTop, fps, colour, DisplayMode, flipAxis);
		i++;
	}
}

void RGBLEDMatrixScrollTextWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], char characters[200], int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int i=0;

	while(characters[i]!=0)
	{
		RGBLEDMatrixShiftInCharacterWithBG(bitmap, bitmapBG, characters[i], xRight, yTop, fps, colour, font, DisplayMode, flipAxis);
		i++;
	}
}

void RGBLEDMatrixScrollValue(unsigned int bitmap[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ RGBLEDMatrixShiftInCharacter(bitmap, digitval+'0', xRight, yTop, fps, colour, font, DisplayMode, flipAxis); }
		unit /= 10;
	}
}

void RGBLEDMatrixScrollValueWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ RGBLEDMatrixShiftInCharacterWithBG(bitmap, bitmapBG, digitval+'0', xRight, yTop, fps, colour, font, DisplayMode, flipAxis); }
		unit /= 10;
	}
}

void RGBLEDMatrixSevSegDigit(unsigned int bitmap[][32], unsigned int val, int xLeft, int yTop, unsigned int colour)
{
	int x;
	int y;
	unsigned int segments;
	unsigned int digits[10]={0x3F, 0x06, 0x5B, 0x4F, 0x66, 0x6D, 0x7D, 0x07, 0x7F, 0x6F};
	
	segments=digits[val];
	
	if(segments & 1)		//seg A
	{
		for(x=xLeft;x<=(xLeft+2);x++){ RGBLEDMatrixSetPixel(bitmap,x,yTop,colour); }
	}

	if(segments & 2)		//seg B
	{
		for(y=yTop;y<=(yTop+2);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft+2,y,colour); }
	}

	if(segments & 4)		//seg C
	{
		for(y=yTop+2;y<=(yTop+4);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft+2,y,colour); }
	}

	if(segments & 8)		//seg D
	{
		for(x=xLeft;x<=(xLeft+2);x++){ RGBLEDMatrixSetPixel(bitmap,x,yTop+4,colour); }
	}

	if(segments & 16)		//seg E
	{
		for(y=yTop+2;y<=(yTop+4);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft,y,colour); }
	}

