bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
	if(segments & 32)		//seg F
	{
		for(y=yTop;y<=(yTop+2);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft,y,colour); }
	}

	if(segments & 64)		//seg G
	{
		for(x=xLeft;x<=(xLeft+2);x++){ RGBLEDMatrixSetPixel(bitmap,x,yTop+2,colour); }
	}
}

unsigned int RGBLEDMatrixSevSegSegMultiDigits(unsigned int bitmap[][32], unsigned int val, int xLeft, int yTop, unsigned int ForceDigits, unsigned int colour)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;
	unsigned int x1=0;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1) || (digit<=ForceDigits)){ print=1; }
		if(print==1){ RGBLEDMatrixSevSegDigit(bitmap, digitval, xLeft+x1, yTop, colour); x1+=4; }
		unit /= 10;
	}
	
	return xLeft+x1;
}

void RGBLEDMatrixSevSegAMPM(unsigned int bitmap[][32], unsigned int AMPM, int xLeft, int yTop, unsigned int DispM, unsigned int colour)
{
	int x;
	int y;
	unsigned int digits[3]={127^8, 2 | 4 | 16 | 32, 127^(4 | 8)};	//A M P
	char strAMPM[2];
	unsigned int i;
	
	if(AMPM==0){ strAMPM[0]=0; }else{ strAMPM[0]=2; }
	strAMPM[1]=1;
	
	for(i=0;i<2;i++)
	{
		if(digits[strAMPM[i]] & 1)		//seg A
		{
			for(x=xLeft;x<=(xLeft+2);x++){ RGBLEDMatrixSetPixel(bitmap,x,yTop,colour); }
		}

		if(digits[strAMPM[i]] & 2)		//seg B
		{
			for(y=yTop;y<=(yTop+2);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft+2,y,colour); }
		}

		if(digits[strAMPM[i]] & 4)		//seg C
		{
			for(y=yTop+2;y<=(yTop+4);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft+2,y,colour); }
		}

		if(digits[strAMPM[i]] & 8)		//seg D
		{
			for(x=xLeft;x<=(xLeft+2);x++){ RGBLEDMatrixSetPixel(bitmap,x,yTop+4,colour); }
		}

		if(digits[strAMPM[i]] & 16)		//seg E
		{
			for(y=yTop+2;y<=(yTop+4);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft,y,colour); }
		}

		if(digits[strAMPM[i]] & 32)		//seg F
		{
			for(y=yTop;y<=(yTop+2);y++){ RGBLEDMatrixSetPixel(bitmap,xLeft,y,colour); }
		}

		if(digits[strAMPM[i]] & 64)		//seg G
		{
			for(x=xLeft;x<=(xLeft+2);x++){ RGBLEDMatrixSetPixel(bitmap,x,yTop+2,colour); }
		}
		
		if(DispM==0){ break; }
		
		if(i==1){ RGBLEDMatrixSetPixel(bitmap,xLeft+1,yTop+1,colour); } //if M, add the middle dot
		
		xLeft+=4;
	}
}

void RGBLEDMatrixShiftInDigitSevSeg(unsigned int bitmap[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int y;
	unsigned int bytenum;
	
	for(bytenum=val*3;bytenum<=((val*3)+2);bytenum++)
	{
		ResetTimer14();
		for(y=0;y<5;y++)	//add byte
		{
			if(((sevsegasciivbw[bytenum]>>y) & 1)==1){ RGBLEDMatrixSetPixel(bitmap,xRight,y+yTop,colour); }
		}
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
		RGBLEDMatrixDisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
		RGBLEDMatrixShiftLeft(bitmap,1);	//scroll
	}

	ResetTimer14();
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
	RGBLEDMatrixDisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
	RGBLEDMatrixShiftLeft(bitmap,1);	//extra 1px space after the character
}

void RGBLEDMatrixShiftInDigitSevSegWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int y;
	unsigned int bytenum;
	unsigned int outputbitmap[32][32];
	
	for(bytenum=val*3;bytenum<=((val*3)+2);bytenum++)
	{
		ResetTimer14();
		for(y=0;y<5;y++)	//add byte
		{
			if(((sevsegasciivbw[bytenum]>>y) & 1)==1){ RGBLEDMatrixSetPixel(bitmap,xRight,y+yTop,colour); }
		}
		RGBLEDMatrixReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
		RGBLEDMatrixDisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
		RGBLEDMatrixShiftLeft(bitmap,1);	//scroll
	}

	ResetTimer14();
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//flip
	RGBLEDMatrixDisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
	if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(bitmap,flipAxis); }	//unflip
	RGBLEDMatrixShiftLeft(bitmap,1);	//extra 1px space after the character
}

void RGBLEDMatrixScrollValueSevSeg(unsigned int bitmap[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ RGBLEDMatrixShiftInDigitSevSeg(bitmap, digitval, xRight, yTop, fps, colour, DisplayMode, flipAxis); }
		unit /= 10;
	}
}

void RGBLEDMatrixScrollValueSevSegWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ RGBLEDMatrixShiftInDigitSevSegWithBG(bitmap, bitmapBG, digitval, xRight, yTop, fps, colour, DisplayMode, flipAxis); }
		unit /= 10;
	}
}

void RGBLEDMatrixDrawSegmentLarge(unsigned int bitmap[][32], unsigned int x, unsigned int y, unsigned int length, unsigned int width, unsigned int type, unsigned int colour)
{
	int i;
	
	switch(type)
	{
		case 0:	//left
			for(i=0;i<width;i++)
			{
				RGBLEDMatrixLine(bitmap, x+i,y+i,x+i,y+(length-1)-i,colour);
			}
		break;
		case 1:	//right
			for(i=0;i<width;i++)
			{
				RGBLEDMatrixLine(bitmap, x+((width-1)-i),y+i,x+((width-1)-i),y+(length-1)-i,colour);
			}
		break;
		case 2:	//top
			for(i=0;i<width;i++)
			{
				RGBLEDMatrixLine(bitmap, x+i,y+i,x+(length-1)-i,y+i,colour);
			}
		break;
		case 3:	//bottom
			for(i=0;i<width;i++)
			{
				RGBLEDMatrixLine(bitmap, x+((width-1)-i),y+i,x+(length-1)-((width-1)-i),y+i,colour);
			}
		break;
		case 4:	//middle
			width>>=1;
			for(i=0;i<width;i++)
			{
				RGBLEDMatrixLine(bitmap, x+((width-1)-i),y+i,x+(length-1)-((width-1)-i),y+i,colour);
			}
			y+=width-1;
			for(i=1;i<width;i++)
			{
				RGBLEDMatrixLine(bitmap, x+i,y+i,x+(length-1)-i,y+i,colour);
			}
		break;
	}
}


