bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
unsigned int RGBLEDMatrixSevSegDigitLarge(unsigned int bitmap[][32], unsigned int digit, unsigned int x, unsigned int y, unsigned int height, unsigned int thickness, unsigned int gap, unsigned int colour)
{
	unsigned int length;

	length=(height>>1)-(gap>>1);
	
	switch(digit)
	{
		case 0:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
		break;
		case 1:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
		break;
		case 2:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 3:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 4:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 5:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 6:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 7:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
		break;
		case 8:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 9:
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			RGBLEDMatrixDrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
	}

