bjornbaverfjord/STM32F429-Discovery/Nx32_RGB_LED.c
	return x+length+(gap<<1)+(length>>2);
}


unsigned int RGBLEDMatrixPrintValueSevSegLarge(unsigned int bitmap[][32], unsigned int val, unsigned int xpos, unsigned int ypos, unsigned int height, unsigned int thickness, unsigned int gap, unsigned int colour)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;

	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ xpos=RGBLEDMatrixSevSegDigitLarge(bitmap, digitval, xpos, ypos, height, thickness, gap, colour); }
		unit /= 10;
	}

	return xpos;
}


unsigned int RGBLEDMatrixPrintValue2DigitsSevSegLarge(unsigned int bitmap[][32], unsigned int val, unsigned int xpos, unsigned int ypos, unsigned int height, unsigned int thickness, unsigned int gap, unsigned int colour)
{
	unsigned int tens, units;

	tens=val/10;
	units=val-(tens*10);
	xpos=RGBLEDMatrixSevSegDigitLarge(bitmap, tens, xpos, ypos, height, thickness, gap, colour);
	xpos=RGBLEDMatrixSevSegDigitLarge(bitmap, units, xpos, ypos, height, thickness, gap, colour);

	return xpos;
}

void printfRGBLEDMatrix(unsigned int bitmap[][32], int x1, int y1, unsigned int font, unsigned int colour, const char * format, ... )
{
	char buff[256];
	unsigned int i=0;
	va_list args;
	
	va_start(args,format);
	vsnprintf(buff,256,format,args);
	
  //print the string
	do
	{
		x1=RGBLEDMatrixCharacter(bitmap, buff[i], x1, y1, colour, font);
		i+=1;
	}while(buff[i]!=0);
	
	va_end(args);
}

void RGBLEDMatrixPlaceBitmap(const unsigned int sourcebitmap[][32], unsigned int destbitmap[][32], unsigned int width, unsigned int height, int xpos, int ypos)
{
	unsigned int x, y;
	
	for(x=0;x<width;x++)
	{
		for(y=0;y<height;y++)
		{
			RGBLEDMatrixSetPixel(destbitmap,x+xpos,y+ypos,sourcebitmap[x][y]);
		}
	}
}

void RGBLEDMatrixShiftInBitmap(const unsigned int sourcebitmap[][32], unsigned int destbitmap[][32], unsigned int width, unsigned int height, int xRight, int yTop, unsigned int endgap, unsigned int fps, unsigned int DisplayMode, unsigned int flipAxis)
{
	unsigned int x, y, mS;
	
	mS=1000/fps;
	
	for(x=0;x<width;x++)
	{
		for(y=0;y<height;y++)
		{
			RGBLEDMatrixSetPixel(destbitmap,xRight,yTop+y,sourcebitmap[x][y]);
		}
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(destbitmap,flipAxis); }	//flip
		RGBLEDMatrixDisplayBitmapDuration(destbitmap, mS, DisplayMode);		//display frame
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(destbitmap,flipAxis); }	//unflip
		RGBLEDMatrixShiftLeft(destbitmap,1);	//scroll
	}

	for(x=0;x<endgap;x++)
	{
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(destbitmap,flipAxis); }	//flip
		RGBLEDMatrixDisplayBitmapDuration(destbitmap, mS, DisplayMode);		//display frame
		if(flipAxis!=LEDNoFlip){ RGBLEDMatrixFlip(destbitmap,flipAxis); }	//unflip
		RGBLEDMatrixShiftLeft(destbitmap,1);
	}
}

void RGBLEDMatrixFlip(unsigned int bitmap[][32], unsigned int flipAxis)
{
	unsigned int bmp[LedMatrixWidth][32], x, y;
	
	if(flipAxis & 1)	//flip X
	{
		for(y=0;y<32;y++)
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				bmp[x][y]=bitmap[(LedMatrixWidth-1)-x][y];
			}
		}
		
		for(y=0;y<32;y++)	//write back
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				bitmap[x][y]=bmp[x][y];
			}
		}
	}
	
	if(flipAxis & 2)	//flip Y
	{
		for(y=0;y<32;y++)
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				bmp[x][y]=bitmap[x][31-y];
			}
		}
		
		for(y=0;y<32;y++)	//write back
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				bitmap[x][y]=bmp[x][y];
			}
		}
	}
}
